In [1]:
# import libraries
import pandas as pd
import duckdb

In [2]:
# import dataset
cards = pd.read_csv('../dataset/cards_data.csv')
users = pd.read_csv('../dataset/users_data.csv')
transactions = pd.read_csv('../dataset/transactions_data.csv')

## Card Analysis

In [ ]:
# show head of cards data
cards.head()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,$24295,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,YES,2,$21968,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,YES,2,$46414,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,NO,1,$12400,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,YES,1,$28,09/2008,2009,No

In [4]:
# check duplicated 
cards.duplicated().sum()

np.int64(0)

In [ ]:
# check missing value
cards.isna().sum()

id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

In [6]:
# remove dolars symbols
cards['credit_limit'] = cards['credit_limit'].str.replace('$', '').astype(int)

In [ ]:
# check information of cards data
cards.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6146 entries, 0 to 6145
Data columns (total 13 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   id                     6146 non-null   int64
 1   client_id              6146 non-null   int64
 2   card_brand             6146 non-null   object
 3   card_type              6146 non-null   object
 4   card_number            6146 non-null   int64
 5   expires                6146 non-null   object
 6   cvv                    6146 non-null   int64
 7   has_chip               6146 non-null   object
 8   num_cards_issued       6146 non-null   int64
 9   credit_limit           6146 non-null   int64
 10  acct_open_date         6146 non-null   object
 11  year_pin_last_changed  6146 non-null   int64
 12  card_on_dark_web       6146 non-null   object
dtypes: int64(7), object(6)
memory usage: 624.3+ KB

In [9]:
# check value counts of category columns
cat_cols = ['card_brand', 'card_type', 'has_chip','card_on_dark_web']

for col in cat_cols:
  print(cards[col].value_counts(dropna=False))
  print('\n')

card_brand
Mastercard    3209
Visa          2326
Amex           402
Discover       209
Name: count, dtype: int64


card_type
Debit              3511
Credit             2057
Debit (Prepaid)     578
Name: count, dtype: int64


has_chip
YES    5500
NO      646
Name: count, dtype: int64


card_on_dark_web
No    6146
Name: count, dtype: int64

In [10]:
cards.head()

,id,client_id,card_brand,card_type,card_number,expires,cvv,has_chip,num_cards_issued,credit_limit,acct_open_date,year_pin_last_changed,card_on_dark_web
0,4524,825,Visa,Debit,4344676511950444,12/2022,623,YES,2,24295,09/2002,2008,No
1,2731,825,Visa,Debit,4956965974959986,12/2020,393,YES,2,21968,04/2014,2014,No
2,3701,825,Visa,Debit,4582313478255491,02/2024,719,YES,2,46414,07/2003,2004,No
3,42,825,Visa,Credit,4879494103069057,08/2024,693,NO,1,12400,01/2003,2012,No
4,4659,825,Mastercard,Debit (Prepaid),5722874738736011,03/2009,75,YES,1,28,09/2008,2009,No

In [57]:
cards.describe().T

,count,mean,std,min,25%,50%,75%,max
id,6146.0,3.072500e+03,1.774342e+03,0.000000e+00,1.536250e+03,3.072500e+03,4.608750e+03,6.145000e+03
client_id,6146.0,9.949396e+02,5.786146e+02,0.000000e+00,4.922500e+02,9.920000e+02,1.495000e+03,1.999000e+03
card_number,6146.0,4.820426e+15,1.328582e+15,3.001055e+14,4.486365e+15,5.108957e+15,5.585237e+15,6.997197e+15
cvv,6146.0,5.062208e+02,2.894311e+02,0.000000e+00,2.570000e+02,5.165000e+02,7.560000e+02,9.990000e+02
num_cards_issued,6146.0,1.503091e+00,5.191909e-01,1.000000e+00,1.000000e+00,1.000000e+00,2.000000e+00,3.000000e+00
credit_limit,6146.0,1.434749e+04,1.201446e+04,0.000000e+00,7.042750e+03,1.259250e+04,1.915650e+04,1.512230e+05
year_pin_last_changed,6146.0,2.013437e+03,4.270699e+00,2.002000e+03,2.010000e+03,2.013000e+03,2.017000e+03,2.020000e+03

## User Analysis

In [ ]:
# show head of users data
users.head()

,id,current_age,retirement_age,birth_year,birth_month,gender,address,latitude,longitude,per_capita_income,yearly_income,total_debt,credit_score,num_credit_cards
0,825,53,66,1966,11,Female,462 Rose Lane,34.15,-117.76,$29278,$59696,$127613,787,5
1,1746,53,68,1966,12,Female,3606 Federal Boulevard,40.76,-73.74,$37891,$77254,$191349,701,5
2,1718,81,67,1938,11,Female,766 Third Drive,34.02,-117.89,$22681,$33483,$196,698,5
3,708,63,63,1957,1,Female,3 Madison Street,40.71,-73.99,$163145,$249925,$202328,722,4
4,1164,43,70,1976,9,Male,9620 Valley Stream Drive,37.76,-122.44,$53797,$109687,$183855,675,1

In [12]:
# check duplicated value
cards.duplicated().sum()

np.int64(0)

In [13]:
# check missing value
cards.isna().sum()

id                       0
client_id                0
card_brand               0
card_type                0
card_number              0
expires                  0
cvv                      0
has_chip                 0
num_cards_issued         0
credit_limit             0
acct_open_date           0
year_pin_last_changed    0
card_on_dark_web         0
dtype: int64

In [14]:
# remove dolars symbols 
users['per_capita_income'] = users['per_capita_income'].str.replace('$', '').astype(int)
users['yearly_income'] = users['yearly_income'].str.replace('$', '').astype(int)
users['total_debt'] = users['total_debt'].str.replace('$', '').astype(int)

In [15]:
users.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2000 entries, 0 to 1999
Data columns (total 14 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   id                 2000 non-null   int64
 1   current_age        2000 non-null   int64
 2   retirement_age     2000 non-null   int64
 3   birth_year         2000 non-null   int64
 4   birth_month        2000 non-null   int64
 5   gender             2000 non-null   object
 6   address            2000 non-null   object
 7   latitude           2000 non-null   float64
 8   longitude          2000 non-null   float64
 9   per_capita_income  2000 non-null   int64
 10  yearly_income      2000 non-null   int64
 11  total_debt         2000 non-null   int64
 12  credit_score       2000 non-null   int64
 13  num_credit_cards   2000 non-null   int64
dtypes: float64(2), int64(10), object(2)
memory usage: 218.9+ KB

In [17]:
users.gender.value_counts()

gender
Female    1016
Male       984
Name: count, dtype: int64

In [18]:
users.describe().T.round(2)

,count,mean,std,min,25%,50%,75%,max
id,2000.0,999.50,577.49,0.00,499.75,999.50,1499.25,1999.00
current_age,2000.0,45.39,18.41,18.00,30.00,44.00,58.00,101.00
retirement_age,2000.0,66.24,3.63,50.00,65.00,66.00,68.00,79.00
birth_year,2000.0,1973.80,18.42,1918.00,1961.00,1975.00,1989.00,2002.00
birth_month,2000.0,6.44,3.57,1.00,3.00,7.00,10.00,12.00
latitude,2000.0,37.39,5.11,20.88,33.84,38.25,41.20,61.20
longitude,2000.0,-91.55,16.28,-159.41,-97.40,-86.44,-80.13,-68.67
per_capita_income,2000.0,23141.93,11324.14,0.00,16824.50,20581.00,26286.00,163145.00
yearly_income,2000.0,45715.88,22992.62,1.00,32818.50,40744.50,52698.50,307018.00
total_debt,2000.0,63709.69,52254.45,0.00,23986.75,58251.00,89070.50,516263.00
credit_score,2000.0,709.73,67.22,480.00,681.00,711.50,753.00,850.00
num_credit_cards,2000.0,3.07,1.64,1.00,2.00,3.00,4.00,9.00

## Transactions Analysis

In [19]:
transactions.head()

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
0,7475327,2010-01-01 00:01:00,1556,2972,$-77.00,Swipe Transaction,59935,Beulah,ND,58523.0,5499,NaN
1,7475328,2010-01-01 00:02:00,561,4575,$14.57,Swipe Transaction,67570,Bettendorf,IA,52722.0,5311,NaN
2,7475329,2010-01-01 00:02:00,1129,102,$80.00,Swipe Transaction,27092,Vista,CA,92084.0,4829,NaN
3,7475331,2010-01-01 00:05:00,430,2860,$200.00,Swipe Transaction,27092,Crown Point,IN,46307.0,4829,NaN
4,7475332,2010-01-01 00:06:00,848,3915,$46.41,Swipe Transaction,13051,Harwood,MD,20776.0,5813,NaN

In [ ]:
# check sahpe of data
transactions.shape

(13305915, 12)

In [20]:
# check duplicated value
transactions.duplicated().sum()

np.int64(0)

In [21]:
# check missing value
transactions.isna().sum()

id                       0
date                     0
client_id                0
card_id                  0
amount                   0
use_chip                 0
merchant_id              0
merchant_city            0
merchant_state     1563700
zip                1652706
mcc                      0
errors            13094522
dtype: int64

In [ ]:
# remove dolars symbol and change data type to float
transactions['amount'] = transactions['amount'].str.replace('$', '').astype(float)

In [23]:
# change data type of date
transactions['date'] = pd.to_datetime(transactions['date'])

In [24]:
# change data type of zip to integer
transactions['zip'] = transactions['zip'].astype("Int64")

In [25]:
transactions.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 13305915 entries, 0 to 13305914
Data columns (total 12 columns):
 #   Column          Dtype
---  ------          -----
 0   id              int64
 1   date            datetime64[ns]
 2   client_id       int64
 3   card_id         int64
 4   amount          float64
 5   use_chip        object
 6   merchant_id     int64
 7   merchant_city   object
 8   merchant_state  object
 9   zip             Int64
 10  mcc             int64
 11  errors          object
dtypes: Int64(1), datetime64[ns](1), float64(1), int64(5), object(4)
memory usage: 1.2+ GB

In [26]:
transactions.dtypes

id                         int64
date              datetime64[ns]
client_id                  int64
card_id                    int64
amount                   float64
use_chip                  object
merchant_id                int64
merchant_city             object
merchant_state            object
zip                        Int64
mcc                        int64
errors                    object
dtype: object

In [27]:
for col in ['merchant_state' , 'use_chip', 'merchant_city', 'merchant_state']:
  print(transactions[col].value_counts(dropna=False))
  print('\n')

merchant_state
NaN           1563700
CA            1427087
TX            1010207
NY             857510
FL             701623
               ...
Ethiopia            3
Suriname            3
Gabon               3
Tonga               2
Azerbaijan          2
Name: count, Length: 200, dtype: int64


use_chip
Swipe Transaction     6967185
Chip Transaction      4780818
Online Transaction    1557912
Name: count, dtype: int64


merchant_city
ONLINE           1563700
Houston           146917
Miami              87388
Brooklyn           84020
Los Angeles        82004
                  ...
Burnett                1
Weaubleau              1
Slemp                  1
Cornettsville          1
London Mills           1
Name: count, Length: 12492, dtype: int64


merchant_state
NaN           1563700
CA            1427087
TX            1010207
NY             857510
FL             701623
               ...
Ethiopia            3
Suriname            3
Gabon               3
Tonga               2
Azerbaijan          2
Name: count, Length: 200, dtype: int64

In [28]:
transactions.head()

,id,date,client_id,card_id,amount,use_chip,merchant_id,merchant_city,merchant_state,zip,mcc,errors
0,7475327,2010-01-01 00:01:00,1556,2972,-77.00,Swipe Transaction,59935,Beulah,ND,58523,5499,NaN
1,7475328,2010-01-01 00:02:00,561,4575,14.57,Swipe Transaction,67570,Bettendorf,IA,52722,5311,NaN
2,7475329,2010-01-01 00:02:00,1129,102,80.00,Swipe Transaction,27092,Vista,CA,92084,4829,NaN
3,7475331,2010-01-01 00:05:00,430,2860,200.00,Swipe Transaction,27092,Crown Point,IN,46307,4829,NaN
4,7475332,2010-01-01 00:06:00,848,3915,46.41,Swipe Transaction,13051,Harwood,MD,20776,5813,NaN

In [71]:
transactions.describe().T

,count,mean,min,25%,50%,75%,max,std
id,13305915.0,15584024.565584,7475327.0,11506044.5,15570866.0,19653605.5,23761874.0,4704498.649443
date,13305915,2015-01-06 06:50:27.604354816,2010-01-01 00:01:00,2012-08-08 21:43:00,2015-01-22 12:17:00,2017-06-13 17:45:00,2019-10-31 23:59:00,NaN
client_id,13305915.0,1026.812046,0.0,519.0,1070.0,1531.0,1998.0,581.638559
card_id,13305915.0,3475.267651,0.0,2413.0,3584.0,4901.0,6144.0,1674.355912
amount,13305915.0,42.976039,-500.0,8.93,28.99,63.71,6820.2,81.655748
merchant_id,13305915.0,47723.763181,1.0,25887.0,45926.0,67570.0,100342.0,25815.337691
zip,11653209.0,51327.819831,1001.0,28602.0,47670.0,77901.0,99928.0,29404.225234
mcc,13305915.0,5565.439815,1711.0,5300.0,5499.0,5812.0,9402.0,875.700238

## SQL Analysis using Duckdb

In [73]:
# siapa user yang mempunyai pendapatan tertinggi
duckdb.sql('select * from users order by yearly_income desc limit 10')

  id    current_age  retirement_age  birth_year  birth_month  gender          address          latitude  longitude  per_capita_income  yearly_income  total_debt  credit_score  num_credit_cards
 int64     int64         int64         int64        int64     varchar         varchar           double    double          int64            int64        int64        int64           int64

  1325           23              66        1996            3  Female   459 East Avenue            37.44     -122.2             150583         307018      516263           745                 2
  1156           56              69        1963            6  Female   9603 South Lane            40.74     -74.33             137428         280199       91367           752                 5
   708           63              63        1957            1  Female   3 Madison Street           40.71     -73.99             163145         249925      202328           722                 4
   777           18              65        2002            1  Male     970 Essex Drive            37.37    -122.21             106305         216740           0           700                 2
  1014           54              70        1965            9  Female   393 Mountain View Lane      33.6    -117.82              96516         196784      437533           729                 3
  1452           46              59        1973            5  Female   524 Ocean Drive            29.76     -95.38              95039         193773      241571           660                 1
   278           59              66        1960            9  Male     910 Eighth Drive           29.76     -95.38              95039         193768      150896           686                 5
  1259           64              69        1955            7  Female   729 Littlewood Avenue      41.18     -73.42              94302         192269      100192           700                 6
  1223           53              67        1966            6  Male     822 Ocean Street            41.8     -87.92              92938         189490      448929           717                 3
   700           21              68        1998           12  Female   649 Second Avenue          40.71     -73.99              91487         186534      233746           590                 1

 10 rows                                                                                                                                                                                           14 columns

In [75]:
duckdb.sql('select * from users where yearly_income < total_debt order by yearly_income desc limit 10')

  id    current_age  retirement_age  birth_year  birth_month  gender              address             latitude  longitude  per_capita_income  yearly_income  total_debt  credit_score  num_credit_cards
 int64     int64         int64         int64        int64     varchar             varchar              double    double          int64            int64        int64        int64           int64

  1325           23              66        1996            3  Female   459 East Avenue                   37.44     -122.2             150583         307018      516263           745                 2
  1014           54              70        1965            9  Female   393 Mountain View Lane             33.6    -117.82              96516         196784      437533           729                 3
  1452           46              59        1973            5  Female   524 Ocean Drive                   29.76     -95.38              95039         193773      241571           660                 1
  1223           53              67        1966            6  Male     822 Ocean Street                   41.8     -87.92              92938         189490      448929           717                 3
   700           21              68        1998           12  Female   649 Second Avenue                 40.71     -73.99              91487         186534      233746           590                 1
  1648           66              69        1953            5  Female   211 Valley Street                 40.76     -74.59              91180         185909      461854           621                 5
   236           36              65        1983            3  Female   4137 Bayview Drive                 29.7     -95.46              79100         161276      317964           540                 1
  1395           58              65        1961            9  Male     2687 Burns Avenue                 40.98     -74.11              75378         153691      197377           604                 2
   453           26              67        1994            2  Female   682 Martin Luther King Avenue     32.79     -96.76              63159         128775      232506           655                 1
   342           18              68        2001            6  Male     3033 Maple Lane                   38.94     -77.19              62840         128123      135808           699                 1

 10 rows                                                                                                                                                                                                  14 columns

In [76]:
# category credit score
duckdb.sql('''
select 
    *,
    case 
      when credit_score between 300 and 579 then 'poor' 
      when credit_score between 580 and 669 then 'fair' 
      when credit_score between 670 and 739 then 'good' 
      when credit_score between 740 and 799 then 'very good' 
      when credit_score between 800 and 850 then 'exceptional'
      else 'others'
    end as credit_category
from 
    users
''')

  id    current_age  retirement_age  birth_year  birth_month  gender           address           latitude  longitude  per_capita_income  yearly_income  total_debt  credit_score  num_credit_cards  credit_category
 int64     int64         int64         int64        int64     varchar          varchar            double    double          int64            int64        int64        int64           int64            varchar

   825           53              66        1966           11  Female   462 Rose Lane                34.15    -117.76              29278          59696      127613           787                 5  very good
  1746           53              68        1966           12  Female   3606 Federal Boulevard       40.76     -73.74              37891          77254      191349           701                 5  good
  1718           81              67        1938           11  Female   766 Third Drive              34.02    -117.89              22681          33483         196           698                 5  good
   708           63              63        1957            1  Female   3 Madison Street             40.71     -73.99             163145         249925      202328           722                 4  good
  1164           43              70        1976            9  Male     9620 Valley Stream Drive     37.76    -122.44              53797         109687      183855           675                 1  good
    68           42              70        1977           10  Male     58 Birch Lane                41.55      -90.6              20599          41997           0           704                 3  good
  1075           36              67        1983           12  Female   5695 Fifth Street            38.22     -85.74              25258          51500      102286           672                 3  good
  1711           26              67        1993           12  Male     1941 Ninth Street            45.51    -122.64              26790          54623      114711           728                 1  good
  1116           81              66        1938            7  Female   11 Spruce Avenue             40.32     -75.32              26273          42509        2895           755                 5  very good
  1752           34              60        1986            1  Female   887 Grant Street             29.97     -92.12              18730          38190       81262           810                 1  exceptional



   932           67              69        1953            2  Male     295 West Avenue              32.36     -92.97              16760          34172       71366           811                 6  exceptional
   378           18              60        2001            5  Female   512 Second Avenue            46.21    -119.16              18753          38241       81833           596                 1  fair
   647           31              72        1988            7  Female   27 Birch Avenue              36.52    -119.39              13194          26900       74083           758                 2  very good
   391           85              66        1934            7  Female   31 Hill Boulevard            33.69     -78.89              19025          35270        1769           731                 6  good
   588           21              66        1998            6  Male     2183 Catherine Boulevard     38.47     -90.75              23106          47109       76035           844                 3  exceptional
   986           32              70        1987            7  Male     6577 Lexington Lane          40.65     -73.58              23550          48010       87837           703                 3  good
  1944           62              65        1957           11  Female   2 Elm Drive                  38.95     -84.54              24218          49378      104480           740                 4  very good
   185           47              67        1973            1  Female   276 Fifth Boulevard          40.66     -74.19              15175          30942       71066           779                 3  very good
  1007           66              60        1954            2  Male     259 Valley Boulevard         40.24     -76.92              25336          54654       27241           618                 1  fair
  1110           21              60        1998           11  Female   472 Ocean View Street        42.86     -71.48              32325          65909      181261           673                 2  good

 2000 rows (20 shown)                                                                                                                                                                                                  15 columns

In [77]:
duckdb.sql('''
with user_clean as (
select 
    *,
    case 
      when credit_score between 300 and 579 then 'poor' 
      when credit_score between 580 and 669 then 'fair' 
      when credit_score between 670 and 739 then 'good' 
      when credit_score between 740 and 799 then 'very good' 
      when credit_score between 800 and 850 then 'exceptional'
      else 'others'
    end as credit_category
from 
    users )

select
    u.credit_category,
    round(sum(amount), 2) as total_amount
from 
    transactions t 
join user_clean u
on t.client_id = u.id
group by u.credit_category
''')

 credit_category  total_amount
     varchar         double

 very good        142520958.64
 exceptional       46738144.43
 poor              21801036.03
 fair              83174343.51
 good             277601039.67

### Mendapatkan chip yang paling sering digunakan

In [37]:
duckdb.sql('''
select 
    use_chip,
    count(*) as count_trans
from 
    transactions
group by use_chip
order by count(*) desc
''')

      use_chip       count_trans
      varchar           int64

 Swipe Transaction       6967185
 Chip Transaction        4780818
 Online Transaction      1557912

### Distribusi umur yang paling sering melakukan transaksi

In [41]:
duckdb.sql('''
select 
    case 
      when u.current_age between 0 and 16 then '0-16'
      when u.current_age between 17 and 24 then '17-24'
      when u.current_age between 25 and 34 then '25-34'
      when u.current_age between 35 and 44 then '35-44'
      when u.current_age between 45 and 54 then '45-54'
      when u.current_age > 54 then '55+'
     end as age_category,
    count(t.id) as count_transactions
from transactions t
left join users u 
on t.client_id = u.id
group by 1
order by 1
''')

 age_category  count_transactions
   varchar           int64

 17-24                      16221
 25-34                    1229086
 35-44                    2808998
 45-54                    3517726
 55+                      5733884

In [50]:
duckdb.sql('''
select 
    case 
      when u.current_age between 0 and 16 then '0-16'
      when u.current_age between 17 and 24 then '17-24'
      when u.current_age between 25 and 34 then '25-34'
      when u.current_age between 35 and 44 then '35-44'
      when u.current_age between 45 and 54 then '45-54'
      when u.current_age > 54 then '55+'
     end as age_category,
    round(sum(t.amount),2) as total_amount
from transactions t
left join users u 
on t.client_id = u.id
group by 1
order by 1
''')

 age_category  total_amount
   varchar        double

 17-24            774022.97
 25-34          57861651.25
 35-44         114570340.63
 45-54         152973355.34
 55+           245656152.09

### Jenis Kartu yang paling sering transaksi

In [42]:
duckdb.sql('''
select 
    c.card_type,
    count(t.id) as count_transactions
from 
    transactions t
left join cards c 
on t.client_id = c.client_id 
group by 1
''')

    card_type     count_transactions
     varchar            int64

 Debit                      29928806
 Credit                     16681413
 Debit (Prepaid)             4505118

### Brand kartu yang paling sering melakukan transaksi

In [43]:
duckdb.sql('''
select 
    c.card_brand,
    count(t.id) as count_transactions
from 
    transactions t
left join cards c 
on t.client_id = c.client_id 
group by 1
''')

 card_brand  count_transactions
  varchar          int64

 Mastercard            26640082
 Discover               1702534
 Amex                   3428736
 Visa                  19343985

### Jenis kelamin yang paling sering melakukan transaksi

In [44]:
duckdb.sql('''
select 
    u.gender,
    count(t.id) as count_transactions
from 
    transactions t
left join users u
on t.client_id = u.id 
group by 1
''')

 gender   count_transactions
 varchar        int64

 Female              6815916
 Male                6489999

In [51]:
duckdb.sql('''
select 
    u.gender,
    round(sum(t.amount),2) as total_amount
from 
    transactions t
left join users u
on t.client_id = u.id 
group by 1
''')

 gender   total_amount
 varchar     double

 Female    293309545.3
 Male     278525976.98

### user yang tidak pernah melakukan transaksi

In [45]:
duckdb.sql('''
select 
    u.*,
from users u 
left join transactions t 
on u.id = t.client_id
where t.client_id is null
''')

  id    current_age  retirement_age  birth_year  birth_month  gender          address          latitude  longitude  per_capita_income  yearly_income  total_debt  credit_score  num_credit_cards
 int64     int64         int64         int64        int64     varchar         varchar           double    double          int64            int64        int64        int64           int64

  1231           26              52        1994            1  Female   613 Little Creek Lane      26.41     -81.42              10819          22066       38967           842                 1
   307           18              69        2001            8  Male     2846 Lake Avenue           30.23     -92.81              18082          36866           0           680                 2
  1968           25              69        1994           11  Female   611 Elm Lane               40.94     -73.86              31299          63816      100128           775                 1
  1734           37              69        1982           11  Male     185 Forest Drive           33.95     -84.54              40530          82637       84762           739                 2
  1033           18              58        2002            2  Female   352 George Street          43.07     -82.49              16598          33844       42109           684                 2
   298           28              65        1991            5  Male     437 Ocean View Drive       40.79     -77.85              25031          51041      106989           686                 1
  1199           29              68        1990            6  Male     704 Eighth Avenue          42.93     -75.38              19161          39069       63884           720                 2
  1191           25              69        1994           12  Female   299 Oak Boulevard          45.19    -123.24              18098          36902       60538           711                 1
   925           31              68        1988            3  Male     4165 Valley Avenue         38.76     -89.97              28710          58538       93153           610                 1
   824           32              66        1987            8  Female   38 Catherine Boulevard     27.75     -82.64              18100          36901       23293           695                 4



  1410           22              63        1998            1  Female   7902 Norfolk Drive          39.3     -76.44              21017          42856       67954           571                 1
     6           19              63        2000            6  Female   534 Second Lane            32.88    -117.13              27394          55854      111042           782                 1
  1681           21              72        1998            6  Male     21 Birch Drive             38.63     -90.24              31909          65058      157708           746                 1
   624           33              66        1987            2  Male     515 Spruce Boulevard       42.89     -85.72              18431          37579       59201           710                 2
   809           54              66        1965            5  Female   2855 Sixth Avenue          41.76     -88.15              41979          85596      159101           618                 1
   105           54              68        1965            8  Male     420 Oak Drive              41.47     -75.57              18432          37579           0           742                 5
   499           23              66        1996            9  Male     8373 Birch Boulevard       40.71     -73.99              18525          37769        1412           742                 2
  1947           87              66        1932            4  Male     770 Maple Street           31.62     -82.88              14060          27971        1265           765                 4
  1545           20              63        1999           12  Male     1433 Rose Boulevard        33.73    -117.05              15144          30882       60484           807                 3
   420           22              62        1998            2  Male     1651 Oak Drive             33.82    -117.91              16252          33140       51305           744                 1

 781 rows (20 shown)                                                                                                                                                                               14 columns

duckdb

In [47]:
duckdb.sql('select mcc, count(*) from transactions group by mcc order by count(*) desc limit 10')

  mcc   count_star()
 int64     int64

  5411       1592584
  5499       1460875
  5541       1424711
  5812        999738
  5912        772913
  4784        674135
  5300        601942
  4829        589140
  4121        500662
  5814        499659

 10 rows    2 columns

In [30]:
duckdb.sql('''
with user_trans as (
select 
    client_id,
    round(sum(amount),2) as total_trans
from 
    transactions
group by client_id
order by sum(amount) desc)
select 
    *
from 
    user_trans
limit 10
''')

 client_id  total_trans
   int64      double

        96   2445773.25
      1686    2167880.9
      1340   2039921.23
       840   1956340.84
       464   1882901.35
       490   1711482.69
       704   1635022.05
       285   1615458.99
       488   1611114.42
      1168   1590822.75

 10 rows       2 columns

In [31]:
duckdb.sql('''
with card_count as (
select 
    client_id,
    count(distinct card_id) as count_card
from 
    transactions
group by client_id
order by count(distinct card_id) desc)
select 
    *
from 
    card_count
limit 10
''')

 client_id  count_card
   int64      int64

      1741           9
      1512           8
      1492           8
      1425           8
      1345           8
      1811           8
      1031           8
       921           8
      1405           8
       989           8

 10 rows      2 columns

In [32]:
duckdb.sql('''
select 
    use_chip,
    count(*) 
from 
    transactions
group by use_chip
''')

      use_chip       count_star()
      varchar           int64

 Chip Transaction         4780818
 Swipe Transaction        6967185
 Online Transaction       1557912

In [33]:
duckdb.sql('''
with transactions as (
select 
    client_id,
    EXTRACT( year from date) as year,
    round(sum(amount),2) as total_trans
from 
    transactions t 
group by client_id, year),
yearly_avg as (
select 
    client_id,
    round(avg(total_trans),2) as avg_yearly_trans
from 
    transactions
group by 1)
select 
    u.id,
    u.yearly_income,
    y.avg_yearly_trans
from 
    users u 
left join yearly_avg y
on u.id = y.client_id
''')

  id    yearly_income  avg_yearly_trans
 int64      int64           double

   646          43634          33773.03
   124          34311          21349.59
  1352          42102          23350.55
  1940          26865          21512.45
  1442          30432          61705.67
   573          30011          26875.37
   173          30399          52655.95
  1492          56635          48677.24
  1783          37607          28380.73
  1479          26631          19801.58



  1410          42856              NULL
     6          55854              NULL
  1681          65058              NULL
   624          37579              NULL
   809          85596              NULL
   105          37579              NULL
   499          37769              NULL
  1947          27971              NULL
  1545          30882              NULL
   420          33140              NULL

 2000 rows (20 shown)           3 columns

In [35]:
duckdb.sql('''
select 
    count(u.id)
from 
    users u
left join transactions t
on u.id = t.client_id
where t.client_id is null      
''')

 count(u.id)
    int64

         781

In [56]:
duckdb.sql('''
SELECT 
    c.card_type,
    u.gender,
    round(AVG(t.amount),2) AS avg_spending,
    COUNT(DISTINCT t.id) AS total_txn
FROM users u
JOIN cards c ON u.id = c.client_id
JOIN transactions t ON c.id = t.card_id
WHERE t.amount > 0
GROUP BY c.card_type, u.gender
ORDER BY avg_spending DESC;
''')

    card_type     gender   avg_spending  total_txn
     varchar      varchar     double       int64

 Credit           Male            65.18    1890912
 Credit           Female          63.83    1997890
 Debit            Female          46.98    4024517
 Debit            Male            46.08    3839864
 Debit (Prepaid)  Male            27.05     428927
 Debit (Prepaid)  Female          24.17     453117

In [70]:
duckdb.sql('''
with trans as (
select
  date :: date as date_2,
  extract(month from date) as month,
  *
from 
  transactions )

select 
    month,
    round(sum(amount),2) as total_amount
from 
    trans
group by month
order by month
''')

 month  total_amount
 int64     double

     1   48706157.19
     2   44522960.71
     3   49314647.53
     4   47797478.55
     5   49192440.78
     6   48424797.72
     7   49696315.04
     8   49510320.78
     9   47944954.74
    10   49435764.38
    11   42900837.01
    12   44388847.85

 12 rows    2 columns